#+title: ~/COMM/Lects/meta-ruby/site/lects/01

**** [ ] rbenv で ruby をインストール    

#+BEGIN_SRC sh :dir ~/COMM/Lects/meta-ruby/site/lects/01/
ls -l
eval "$(rbenv init -)" #初期化
# rbenv install --list # インストール可な ruby を表示
# rbenv install 2.3-dev # 最新
# rbenv init # pathの再設定 と .bashrc への追加
#+END_SRC

#+RESULTS:
| 合計       | 156 |        |    |       |      |    |       |              |
| -rw-r--r-- |   1 | suzuki | os | 10085 | 10月 |  5 | 14:31 | #01-GTD.org# |
| -rw-r--r-- |   1 | suzuki | os | 25742 | 10月 |  5 | 14:36 | 01-GTD.html  |
| -rw-r--r-- |   1 | suzuki | os | 10037 | 10月 | 26 | 10:47 | 01-GTD.org   |
| -rw-r--r-- |   1 | suzuki | os |  3120 | 10月 |  5 | 11:09 | 01-todo.org  |
| -rw-r--r-- |   1 | suzuki | os | 16444 | 10月 | 26 | 10:47 | 1.html       |
| -rw-r--r-- |   1 | suzuki | os |  2585 | 10月 | 26 | 10:47 | 1.org        |
| -rw-r--r-- |   1 | suzuki | os | 30455 | 10月 |  5 | 11:58 | index.html   |
| -rw-r--r-- |   1 | suzuki | os | 30455 | 10月 |  5 | 11:48 | index.html~  |
| -rw-r--r-- |   1 | suzuki | os |   241 | 10月 |  5 | 12:25 | index.org    |
| -rw-r--r-- |   1 | suzuki | os |   166 | 10月 |  5 | 11:20 | index.org~   |
| -rw-r--r-- |   1 | suzuki | os |  2647 | 10月 | 26 | 10:47 | plan.org     |

